# 共通の定数を定義

class constants:

    # 盤面、画面のサイズ
    BOARD_SIZE = 8
    CELL_SIZE = 80
    WINDOW_SIZE = BOARD_SIZE * CELL_SIZE
    INTO_HEIGHT = 40

    # 画面の全体サイズ（スコア表示領域含む）
    TOTAL_HEIGHT = WINDOW_SIZE + INTO_HEIGHT
    
    # カラー
    LINE_COLOR = (0, 0, 0)
    BG_COLOR = (0, 128, 0)
    BLACK = (0, 0, 0)
    WHITE = (255, 255, 255)

    # プレイヤー石の識別子
    BLACK_DISC = 'B'
    WHITE_DISC = 'W'
    EMPTY = None

    # 8方向のベクトル（上下左右＋斜め）
    DIRECTIONS = [(-1, -1), (-1, 0), (-1, 1),
                  ( 0, -1),          ( 0, 1),
                  ( 1, -1), ( 1, 0), ( 1, 1)]
    
    # 重みマップ（静的評価関数）
    # コンピュータ用に、最良の手を判断するときに使う（プラスの値が大きいほど優先され、マイナスの値が大きいのは避ける）
    WEIGHTS = [
        [100, -20, 10,  5,  5, 10, -20, 100],
        [-20, -50, -2, -2, -2, -2, -50, -20],
        [ 10,  -2, -1, -1, -1, -1,  -2,  10],
        [  5,  -2, -1, -1, -1, -1,  -2,   5],
        [  5,  -2, -1, -1, -1, -1,  -2,   5],
        [ 10,  -2, -1, -1, -1, -1,  -2,  10],
        [-20, -50, -2, -2, -2, -2, -50, -20],
        [100, -20, 10,  5,  5, 10, -20, 100]    
    ]
